### Terraform Environment Changes "shared"
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
google_project_iam_binding.tf-deployer-owner: Refreshing state... [id=projects/ost-cas-adv-fee/roles/owner]
data.google_storage_bucket.terraform: Reading...
google_service_account.tf-deployer: Refreshing state... [id=projects/ost-cas-adv-fee/serviceAccounts/qwacker-api-terraform-deployer@ost-cas-adv-fee.iam.gserviceaccount.com]
data.google_project.project: Reading...
google_service_account_key.tf-deployer-key: Refreshing state... [id=projects/ost-cas-adv-fee/serviceAccounts/qwacker-api-terraform-deployer@ost-cas-adv-fee.iam.gserviceaccount.com/keys/1b9f36659a54b31197935ab9b4a311bbae03efa5]
data.google_project.project: Read complete after 1s [id=projects/ost-cas-adv-fee]
data.google_storage_bucket.terraform: Read complete after 1s [id=cas-fee-adv-qwacker-api-terraform]
google_storage_bucket_object.tf-deployer-key-file: Refreshing state... [id=cas-fee-adv-qwacker-api-terraform-tf-deployer.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_project_iam_binding.tf-deployer-owner will be destroyed
  # (because google_project_iam_binding.tf-deployer-owner is not in configuration)
  - resource "google_project_iam_binding" "tf-deployer-owner" {
      - etag    = "BwXpzT5AoYI=" -> null
      - id      = "projects/ost-cas-adv-fee/roles/owner" -> null
      - members = [
          - "serviceAccount:qwacker-api-terraform-deployer@ost-cas-adv-fee.iam.gserviceaccount.com",
        ] -> null
      - project = "projects/ost-cas-adv-fee" -> null
      - role    = "roles/owner" -> null
    }

  # google_project_iam_member.cloud-runner["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "cloud-runner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.cloud-runner["roles/run.admin"] will be created
  + resource "google_project_iam_member" "cloud-runner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/run.admin"
    }

  # google_project_iam_member.cloud-runner["roles/run.serviceAgent"] will be created
  + resource "google_project_iam_member" "cloud-runner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/run.serviceAgent"
    }

  # google_project_iam_member.cloud-runner["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "cloud-runner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/storage.objectViewer"
    }

  # google_project_iam_member.cloud-runner["roles/viewer"] will be created
  + resource "google_project_iam_member" "cloud-runner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/viewer"
    }

  # google_project_iam_member.cloud-runner-svc will be created
  + resource "google_project_iam_member" "cloud-runner-svc" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-714602723919@serverless-robot-prod.iam.gserviceaccount.com"
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/run.serviceAgent"
    }

  # google_project_iam_member.tf-deployer-owner will be created
  + resource "google_project_iam_member" "tf-deployer-owner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:qwacker-api-terraform-deployer@ost-cas-adv-fee.iam.gserviceaccount.com"
      + project = "projects/ost-cas-adv-fee"
      + role    = "roles/owner"
    }

  # google_service_account.cloud-runner will be created
  + resource "google_service_account" "cloud-runner" {
      + account_id   = "cloud-runner"
      + description  = "Account to deploy applications to google cloud run and access SQL instance."
      + disabled     = false
      + display_name = "Google Cloud Run"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.local-dev-gcs-access will be created
  + resource "google_service_account" "local-dev-gcs-access" {
      + account_id   = "qwacker-api-gcs-local"
      + description  = "Account to access the local dev gcs bucket."
      + disabled     = false
      + display_name = "Storage Access Local Development"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_key.cloud-runner-key will be created
  + resource "google_service_account_key" "cloud-runner-key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_service_account_key.local-dev-gcs-access-key will be created
  + resource "google_service_account_key" "local-dev-gcs-access-key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_sql_database_instance.pgsql-db will be created
  + resource "google_sql_database_instance" "pgsql-db" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_14"
      + deletion_protection           = true
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "qwacker-api-pgsql-14"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "europe-west6"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-g1-small"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + location                       = "europe-west6"
              + point_in_time_recovery_enabled = true
              + start_time                     = "00:00"
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + insights_config {
              + query_insights_enabled = true
              + query_string_length    = 1024
            }

          + ip_configuration {
              + ipv4_enabled = true

              + authorized_networks {
                  + name  = "smartive AG"
                  + value = "85.195.221.58/32"
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }

          + maintenance_window {
              + day  = 7
              + hour = 0
            }
        }
    }

  # google_storage_bucket.gcs-bucket-local-dev will be created
  + resource "google_storage_bucket" "gcs-bucket-local-dev" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST6"
      + name                        = "local-dev-qwacker-api-data"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # google_storage_bucket_access_control.gcs-bucket-local-dev will be created
  + resource "google_storage_bucket_access_control" "gcs-bucket-local-dev" {
      + bucket = "local-dev-qwacker-api-data"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

  # google_storage_bucket_iam_member.local-dev-gcs-iam will be created
  + resource "google_storage_bucket_iam_member" "local-dev-gcs-iam" {
      + bucket = "local-dev-qwacker-api-data"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_object.cloud-runner-key-file will be created
  + resource "google_storage_bucket_object" "cloud-runner-key-file" {
      + bucket         = "cas-fee-adv-qwacker-api-terraform"
      + content        = (sensitive value)
      + content_type   = "application/json; charset=utf-8"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "google-cloud-runner.json"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.local-dev-gcs-access-key-file will be created
  + resource "google_storage_bucket_object" "local-dev-gcs-access-key-file" {
      + bucket         = "cas-fee-adv-qwacker-api-terraform"
      + content        = (sensitive value)
      + content_type   = "application/json; charset=utf-8"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "local-dev-sa-key.json"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 17 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cloud-runner-email                = (known after apply)
  + pgsql-db-instance-connection-name = (known after apply)
  + pgsql-db-name                     = "qwacker-api-pgsql-14"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>